<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/0cbae9d4-3b7b-43d8-b709-abd208a3902a/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.monitoring.data.jsonnet_file.dashboard will be read during apply
  # (config refers to values not yet known)
 <= data "jsonnet_file" "dashboard" {
      + ext_str  = {
          + "cloudwatch_uid"   = (known after apply)
          + "dashboard_title"  = "staging - history"
          + "dashboard_uid"    = "staging-history"
          + "docdb_cluster_id" = "walletconnect-staging-history-history-db-primary"
          + "ecs_service_name" = "walletconnect-staging-history-service"
          + "environment"      = "staging"
          + "notifications"    = jsonencode([])
          + "prometheus_uid"   = (known after apply)
        }
      + id       = (known after apply)
      + rendered = (known after apply)
      + source   = "monitoring/dashboard.jsonnet"
    }

  # module.monitoring.grafana_dashboard.main will be created
  + resource "grafana_dashboard" "main" {
      + config_json  = (known after apply)
      + dashboard_id = (known after apply)
      + id           = (known after apply)
      + message      = "Updated by Terraform"
      + overwrite    = true
      + slug         = (known after apply)
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

  # module.monitoring.grafana_data_source.cloudwatch will be created
  + resource "grafana_data_source" "cloudwatch" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + defaultRegion = "eu-central-1"
            }
        )
      + name               = "walletconnect-eu-central-1-staging-history-cloudwatch"
      + type               = "cloudwatch"
      + uid                = (known after apply)
    }

  # module.monitoring.grafana_data_source.prometheus will be created
  + resource "grafana_data_source" "prometheus" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + httpMethod    = "GET"
              + manageAlerts  = false
              + sigV4Auth     = true
              + sigV4AuthType = "ec2_iam_role"
              + sigV4Region   = "eu-central-1"
            }
        )
      + name               = "walletconnect-eu-central-1-staging-history-amp"
      + type               = "prometheus"
      + uid                = (known after apply)
      + url                = "https://aps-workspaces.eu-central-1.amazonaws.com/workspaces/ws-86adde76-f99a-4773-847b-00e9b4384c0a/"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.monitoring.data.jsonnet_file.dashboard will be read during apply%0A  # (config refers to values not yet known)%0A <= data "jsonnet_file" "dashboard" {%0A      + ext_str  = {%0A          + "cloudwatch_uid"   = (known after apply)%0A          + "dashboard_title"  = "staging - history"%0A          + "dashboard_uid"    = "staging-history"%0A          + "docdb_cluster_id" = "walletconnect-staging-history-history-db-primary"%0A          + "ecs_service_name" = "walletconnect-staging-history-service"%0A          + "environment"      = "staging"%0A          + "notifications"    = jsonencode([])%0A          + "prometheus_uid"   = (known after apply)%0A        }%0A      + id       = (known after apply)%0A      + rendered = (known after apply)%0A      + source   = "monitoring/dashboard.jsonnet"%0A    }%0A%0A  # module.monitoring.grafana_dashboard.main will be created%0A  + resource "grafana_dashboard" "main" {%0A      + config_json  = (known after apply)%0A      + dashboard_id = (known after apply)%0A      + id           = (known after apply)%0A      + message      = "Updated by Terraform"%0A      + overwrite    = true%0A      + slug         = (known after apply)%0A      + uid          = (known after apply)%0A      + url          = (known after apply)%0A      + version      = (known after apply)%0A    }%0A%0A  # module.monitoring.grafana_data_source.cloudwatch will be created%0A  + resource "grafana_data_source" "cloudwatch" {%0A      + access_mode        = "proxy"%0A      + basic_auth_enabled = false%0A      + id                 = (known after apply)%0A      + is_default         = false%0A      + json_data_encoded  = jsonencode(%0A            {%0A              + defaultRegion = "eu-central-1"%0A            }%0A        )%0A      + name               = "walletconnect-eu-central-1-staging-history-cloudwatch"%0A      + type               = "cloudwatch"%0A      + uid                = (known after apply)%0A    }%0A%0A  # module.monitoring.grafana_data_source.prometheus will be created%0A  + resource "grafana_data_source" "prometheus" {%0A      + access_mode        = "proxy"%0A      + basic_auth_enabled = false%0A      + id                 = (known after apply)%0A      + is_default         = false%0A      + json_data_encoded  = jsonencode(%0A            {%0A              + httpMethod    = "GET"%0A              + manageAlerts  = false%0A              + sigV4Auth     = true%0A              + sigV4AuthType = "ec2_iam_role"%0A              + sigV4Region   = "eu-central-1"%0A            }%0A        )%0A      + name               = "walletconnect-eu-central-1-staging-history-amp"%0A      + type               = "prometheus"%0A      + uid                = (known after apply)%0A      + url                = "https://aps-workspaces.eu-central-1.amazonaws.com/workspaces/ws-86adde76-f99a-4773-847b-00e9b4384c0a/"%0A    }%0A%0APlan: 3 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Action: `pull_request`*